CREATE TABLE cooking_methods (
    id INT PRIMARY KEY AUTO_INCREMENT,
    method_name VARCHAR(50) NOT NULL UNIQUE
);

CREATE TABLE recipes (
    id INT PRIMARY KEY AUTO_INCREMENT,
    recipe_name VARCHAR(100) NOT NULL UNIQUE,
    description TEXT,
    image_url TEXT,
    youtube_url TEXT,
    method_id INT NOT NULL,
    comment TEXT DEFAULT NULL,

    FOREIGN KEY (method_id) REFERENCES cooking_methods(id) ON DELETE CASCADE,
    INDEX (method_id)
);

CREATE TABLE recipe_details (
    id INT PRIMARY KEY AUTO_INCREMENT,
    recipe_id INT NOT NULL,
    ingredients TEXT,
    steps TEXT,

    FOREIGN KEY (recipe_id) REFERENCES recipes(id) ON DELETE CASCADE,
    INDEX (recipe_id)
);

INSERT INTO cooking_methods (method_name) VALUES
('ต้ม'),
('ทอด'),
('นึ่ง'),
('ยำ');

INSERT INTO recipes (recipe_name, description, image_url, youtube_url, method_id) VALUES
('ต้มปลาทูน้ำใส', 'ต้มปลาทูในน้ำซุปใส รสชาตินุ่มนวล', 'https://i.ytimg.com/vi/IQoQnkJJJPM/maxresdefault.jpg', 'https://www.youtube.com/watch?v=IQoQnkJJJPM', 1),
('ต้มปลาทูสมุนไพร', 'ต้มปลาทูกับสมุนไพรไทยหอมๆ เช่น ตะไคร้ ใบมะกรูด', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTFYIEyRp8_DxmZnSOZo3cEr02qlPIDdsBOug&s', 'https://www.youtube.com/watch?v=cVFj8fAoCpk', 1),
('ต้มปลาทูมะเขือเทศ', 'ต้มปลาทูกับมะเขือเทศเปรี้ยวๆ สดชื่น', 'https://image.made-in-china.com/2f0j00kbwiSHCnweoY/Canned-Sardine-Canned-Sardine-Fish-in-Tomato-Sauce-Best-Quality-From-China.webp', 'https://www.youtube.com/watch?v=hhpUhklXak0', 1),
('ต้มปลาทูพริกไทยดำ', 'ต้มปลาทูกับพริกไทยดำรสจัดจ้าน', 'https://i.ytimg.com/vi/XKnvYWoEjFk/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLCqGcAr-bmozWGzAJ-8JNHDs1dzJg', 'https://www.youtube.com/watch?v=pL-9zMx-IWA', 1),
('ต้มปลาทูเกลือ', 'ต้มปลาทูกับเกลือแบบดั้งเดิม เพิ่มรสชาติเค็มๆ', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQx8kjznZ6ag5Ci3XxyyM3aV1ZSDod7Z-6vjQ&s', 'https://www.youtube.com/watch?v=85uJTF6iKC0', 1),
('ต้มปลาทูไข่เค็ม', 'ต้มปลาทูกับไข่เค็มและเครื่องเทศ', 'https://i.ytimg.com/vi/iNVhnJqVlUA/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLD9QvZCjneW3a5cKWa6HVcyKA9NbA', 'https://www.youtube.com/watch?v=iNVhnJqVlUA', 1),
('ต้มปลาทูหน่อไม้', 'ต้มปลาทูในน้ำซุปหน่อไม้ อร่อยกรอบ', 'https://i.ytimg.com/vi/8YePwJsOfGI/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLC_xbzfciocq4TprCFtD9wlOoVrpw', 'https://www.youtube.com/watch?v=8YePwJsOfGI', 1),
('ต้มปลาทูเต้าเจี้ยว', 'ต้มปลาทูกับเต้าเจี้ยวและผักสด', 'https://www.bloggang.com/data/jazzy-bong/picture/1320212494.jpg', 'https://www.youtube.com/watch?v=7YSfQBXahJ8', 1),
('ปลาทูทอดกระเทียม', 'ปลาทูทอดกรอบๆ โรยกระเทียมทอดกรอบๆ หอมๆ', 'https://i.ytimg.com/vi/MCbHtmXlwH0/maxresdefault.jpg', 'https://www.youtube.com/watch?v=JLzNnXogKKQ', 2),
('ปลาทูทอดน้ำปลา', 'ปลาทูทอดกรอบๆ โรยด้วยน้ำปลาเค็มๆ อร่อย', 'https://i.ytimg.com/vi/cRdeB4pLbtg/sddefault.jpg', 'https://www.youtube.com/watch?v=cRdeB4pLbtg', 2),
('ปลาทูทอดขมิ้น', 'ปลาทูทอดกรอบๆ เคล้ากับขมิ้นหอมๆ', 'https://www.pim.in.th/images/all-side-dish-fish/grilled-mackerel-with-turmeric/grilled-mackerel-with-turmeric-10.jpg', 'https://www.youtube.com/watch?v=eUJvdE9qeFk', 2),
('ปลาทูทอดกระเทียมพริกขี้หนู', 'ปลาทูทอดกรอบๆ โรยกระเทียมกับพริกขี้หนูรสจัด', 'https://i.ytimg.com/vi/OLWaGu8l980/sddefault.jpg', 'https://www.youtube.com/watch?v=OLWaGu8l980', 2),
('ปลาทูทอดกรอบ', 'ปลาทูทอดจนกรอบ ทานกับข้าวสวย', 'https://api2.krua.co/wp-content/uploads/2020/06/SlideBanner1140x507-498.jpg', 'https://www.youtube.com/watch?v=gwUJ3Z2Xhkw', 2),
('ปลาทูทอดสมุนไพร', 'ปลาทูทอดกรอบๆ คลุกเคล้ากับสมุนไพรสด', 'https://i.ytimg.com/vi/Ra_lwh_BdwQ/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLBvZHeIW2y0XBqzLu0-Vw8_X6prMg', 'https://www.youtube.com/watch?v=Ra_lwh_BdwQ', 2),
('ปลาทูทอดกรอบพริกเผา', 'ปลาทูทอดกรอบๆ คลุกเคล้ากับพริกเผา', 'https://img-global.cpcdn.com/recipes/e9cb5fc5a2246cac/1200x630cq70/photo.jpg', 'https://www.youtube.com/watch?v=lXEwOCBAPBc', 2),
('ปลาทูทอดพริกขี้หนู', 'ปลาทูทอดกรอบๆ ผสมพริกขี้หนูสดเผ็ดๆ', 'https://i.ytimg.com/vi/5_Y5bFLoXdU/maxresdefault.jpg', 'https://www.youtube.com/watch?v=5_Y5bFLoXdU', 2),
('ปลาทูนึ่งสมุนไพร', 'ปลาทูสดๆ นึ่งกับสมุนไพรไทย ตะไคร้ ใบมะกรูด', 'https://i.ytimg.com/vi/2DkFQpB6FGA/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLDDCEOwt6yMajxrowTA2uFsXhh1-g', 'https://www.youtube.com/watch?v=2DkFQpB6FGA', 3),
('ปลาทูนึ่งมะนาว', 'ปลาทูนึ่งกับมะนาวและพริกไทยเพิ่มรสชาติ', 'https://i.ytimg.com/vi/Dx6GheyIWoY/sddefault.jpg', 'https://www.youtube.com/watch?v=d-FR-5LoHLc', 3),
('ปลาทูนึ่งขมิ้น', 'ปลาทูนึ่งกับขมิ้นเพิ่มสีสันและรสชาติ', 'https://www.matichonweekly.com/wp-content/uploads/2017/07/DSC04110_0.jpg', 'https://www.youtube.com/watch?v=TOE-fVdGKL8', 3),
('ปลาทูนึ่งใบมะกรูด', 'ปลาทูนึ่งกับใบมะกรูดและขิงหอมๆ', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRltB-MJrRre5WgEn3Eh5vDcfkwOntKbe6yxQ&s', 'https://www.youtube.com/watch?v=3yL5ytX1Nig', 3),
('ปลาทูนึ่งน้ำปลา', 'ปลาทูนึ่งกับน้ำปลาหอมๆ เค็มๆ', 'https://www.bloggang.com/data/jazzy-bong/picture/1282881975.jpg', 'https://www.youtube.com/watch?v=p8AKzbp0mVk', 3),
('ปลาทูนึ่งพริกไทย', 'ปลาทูนึ่งกับพริกไทยดำเพิ่มรสชาติ', 'https://i.ytimg.com/vi/tJKkWB_WNuQ/sddefault.jpg', 'https://www.youtube.com/watch?v=tJKkWB_WNuQ', 3),
('ปลาทูนึ่งมะเขือเทศ', 'ปลาทูนึ่งกับมะเขือเทศเพิ่มความเปรี้ยวหวาน', 'https://i.ytimg.com/vi/E1p7upKUPog/hqdefault.jpg', 'https://www.youtube.com/watch?v=E1p7upKUPog', 3),
('ปลาทูนึ่งเกลือ', 'ปลาทูนึ่งแบบเกลือเพิ่มรสชาติเค็มๆ', 'https://f.ptcdn.info/266/079/000/rmri1g1rv3g6r9lHNeuuq-o.jpg', 'https://www.youtube.com/watch?v=b0No4EYPqIk', 3),
('ยำปลาทูน้ำพริกเผา', 'ยำปลาทูเนื้อแน่นๆ ผสมกับน้ำพริกเผารสจัด', 'https://i.ytimg.com/vi/OTpbjYtZ8yE/maxresdefault.jpg', 'https://www.youtube.com/watch?v=OTpbjYtZ8yE', 4),
('ยำปลาทูมะม่วง', 'ยำปลาทูกับมะม่วงเปรี้ยวๆ รสชาติจัดจ้าน', 'https://i.ytimg.com/vi/wudpqoIU-Vc/maxresdefault.jpg', 'https://www.youtube.com/watch?v=wudpqoIU-Vc', 4),
('ยำปลาทูใบชะพลู', 'ยำปลาทูกับใบชะพลูหอมๆ เพิ่มความเผ็ด', 'https://www.papamenu.com/wp-content/uploads/2011/05/CookLek_25500308.jpg', 'https://www.youtube.com/watch?v=nmFHdP82HVY', 4),
('ยำปลาทูใส่สมุนไพร', 'ยำปลาทูใส่สมุนไพรเพิ่มรสชาติและกลิ่นหอม', 'https://i.ytimg.com/vi/rKEVgY8rgUA/sddefault.jpg', 'https://www.youtube.com/watch?v=rKEVgY8rgUA', 4),
('ยำปลาทูขมิ้น', 'ยำปลาทูกับขมิ้นเพิ่มสีสันและรสชาติ', 'https://img.wongnai.com/p/1920x0/2018/12/25/6377aeaf198b4297ab1fc245c1239664.jpg', 'https://www.youtube.com/watch?v=cKqT511-EUY', 4),
('ยำปลาทูมะเขือเทศ', 'ยำปลาทูกับมะเขือเทศสดๆ รสเปรี้ยวๆ', 'https://i.ytimg.com/vi/myD5EpbRMlQ/sddefault.jpg', 'https://www.youtube.com/watch?v=jlfiQvOtiRk', 4),
('ยำปลาทูเค็ม', 'ยำปลาทูที่ผสมผสานความหอมเค็มของปลาทูกับเครื่องยำ', 'https://img.wongnai.com/p/1920x0/2018/12/11/babb8c0a4cc7468b8f10d77a70e265ba.jpg', 'https://www.youtube.com/watch?v=Ekv7fijLqgQ', 4),
('ยำปลาทูพริกสด', 'ยำปลาทูกับพริกสดๆ เพิ่มความเผ็ดร้อน', 'https://i.ytimg.com/vi/1e4GIYLfrR0/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLC9rg2QMTIofJ2WwV9shRVU9uwA3A', 'https://www.youtube.com/watch?v=1e4GIYLfrR0', 4);

INSERT INTO recipe_details (recipe_id, ingredients, steps) VALUES
(1, 'ปลาทูสด 2 ตัว, น้ำ 1 ลิตร, เกลือ 1 ช้อนชา, ขึ้นฉ่าย 1 ต้น, กระเทียม 3 กลีบ',
CONCAT( 
'1. ล้างปลาทูโดยการใช้เกลือขัดเมือกออกให้หมด ใช้น้ำสะอาดล้างซ้ำ แล้วบั้งตัวปลา 2-3 รอบ', CHAR(10),
'2. ปอกกระเทียมแล้วบุบพอแตก หั่นขึ้นฉ่ายเป็นท่อนขนาด 2 นิ้ว', CHAR(10),
'3. ตั้งหม้อใส่น้ำ เปิดไฟกลาง รอให้น้ำเดือด', CHAR(10), 
'4. ใส่กระเทียมบุบและเกลือลงในหม้อ ต้มให้เดือดต่ออีก 1 นาที', CHAR(10),
'5. ใส่ปลาทูลงไป ลดเป็นไฟอ่อน ต้มประมาณ 5-7 นาทีจนปลาสุก', CHAR(10),
'6. ใส่ขึ้นฉ่ายหั่นท่อนลงไป คนเบา ๆ แล้วปิดไฟ')),

(2, 'ปลาทูสด 2 ตัว, ตะไคร้ 2 ต้น, ใบมะกรูด 5 ใบ, เกลือ 1 ช้อนชา, กระเทียม 3 กลีบ',
CONCAT( 
'1. ล้างปลาทูให้สะอาด และบั้งตัวปลา', CHAR(10),
'2. ตำกระเทียมให้ละเอียด ใส่ตะไคร้ทุบ และใบมะกรูด', CHAR(10),
'3. ใส่เครื่องสมุนไพรและเกลือลงในหม้อที่มีน้ำเดือด', CHAR(10),
'4. ใส่ปลาทูลงไปต้มประมาณ 5-7 นาที จนปลาสุก', CHAR(10),  
'5. ปิดไฟ ใส่ใบมะกรูดเพิ่มกลิ่นหอม')),

(3, 'ปลาทูสด 2 ตัว, มะเขือเทศ 2 ลูก, พริกสด 2 เม็ด, ขึ้นฉ่าย 1 ต้น',
CONCAT( 
'1. ล้างปลาทูให้สะอาด และบั้งปลา', CHAR(10),
'2. หั่นมะเขือเทศเป็นชิ้นเล็ก ใส่ลงในหม้อ', CHAR(10),
'3. ใส่พริกสดและน้ำต้มปลา ต้มให้เดือดประมาณ 5-7 นาที', CHAR(10),
'4. ใส่ปลาทูลงไปและต้มจนปลาสุก', CHAR(10),
'5. ใส่ขึ้นฉ่ายหั่นท่อน')),

(4, 'ปลาทูสด 2 ตัว, พริกไทยดำ 1 ช้อนชา, กระเทียม 3 กลีบ, เกลือ 1 ช้อนชา',
CONCAT( 
'1. ล้างปลาทูให้สะอาด บั้งปลา', CHAR(10),
'2. ตำกระเทียมและพริกไทยดำให้ละเอียด', CHAR(10),
'3. ใส่เกลือและเครื่องตำลงในน้ำเดือด ต้มให้เดือดจนกลิ่นเครื่องปรุงหอม', CHAR(10), 
'4. ใส่ปลาทูลงไปต้มประมาณ 5-7 นาทีจนปลาสุก')),

(5, 'ปลาทูสด 2 ตัว, น้ำพริกเผา 2 ช้อนโต๊ะ, หอมแดง 2 หัว, น้ำมะนาว 1 ช้อนโต๊ะ, ผักสด 1 ถ้วย',
CONCAT( 
'1. ล้างปลาทูให้สะอาด และบั้งปลา', CHAR(10), 
'2. ตำหอมแดงและน้ำพริกเผาจนละเอียด', CHAR(10),  
'3. ใส่ผักสดลงในจาน', CHAR(10),  
'4. ใส่ปลาทูที่ต้มแล้วลงบนผักสด', CHAR(10),  
'5. โรยด้วยน้ำมะนาวและคลุกเคล้าให้เข้ากัน')),

(6, 'ปลาทูสด 2 ตัว, มะม่วง 1 ลูก, น้ำปลา 1 ช้อนโต๊ะ, น้ำตาลทราย 1 ช้อนชา',
CONCAT( 
'1. ล้างปลาทูให้สะอาด บั้งปลา', CHAR(10),  
'2. ปอกมะม่วงและหั่นเป็นชิ้นเล็ก', CHAR(10),  
'3. คลุกเคล้าปลาทูและมะม่วงเข้าด้วยกัน', CHAR(10),  
'4. ใส่น้ำปลาและน้ำตาลทรายตามลงไป คนให้เข้ากัน')),

(7, 'ปลาทูสด 2 ตัว, ใบชะพลู 10 ใบ, พริกขี้หนู 5 เม็ด, น้ำตาลปี๊บ 1 ช้อนชา',
CONCAT( 
'1. ล้างปลาทูให้สะอาด บั้งปลา', CHAR(10),  
'2. หั่นใบชะพลูและพริกขี้หนู', CHAR(10),  
'3. คลุกเคล้าปลาทู ใบชะพลู และพริกขี้หนูเข้าด้วยกัน', CHAR(10),  
'4. ใส่น้ำตาลปี๊บเพิ่มรสหวานและคลุกให้เข้ากัน')),

(8, 'ปลาทูสด 2 ตัว, ตะไคร้ 2 ต้น, ใบมะกรูด 5 ใบ, พริกขี้หนู 5 เม็ด, กระเทียม 3 กลีบ', 
CONCAT(
'1. ล้างปลาทูให้สะอาด และบั้งปลา', CHAR(10),  
'2. ตำกระเทียมและพริกขี้หนูให้ละเอียด', CHAR(10),  
'3. ใส่ตะไคร้ทุบและใบมะกรูดลงในหม้อ', CHAR(10),  
'4. ต้มปลาทูให้เดือดประมาณ 5-7 นาทีจนปลาสุก', CHAR(10), 
'5. คลุกเคล้าให้เข้ากัน')),

(9, 'ปลาทูสด 2 ตัว, กระเทียม 5 กลีบ, น้ำมันพืช 1 ช้อนโต๊ะ, เกลือ 1 ช้อนชา', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งปลา', CHAR(10),  
'2. ตำกระเทียมให้ละเอียด', CHAR(10),  
'3. ตั้งกระทะใส่น้ำมันพืช รอให้น้ำมันร้อน', CHAR(10),  
'4. ใส่ปลาทูลงทอดจนกรอบ', CHAR(10),  
'5. โรยกระเทียมทอดจนหอมและกรอบพอประมาณ')),

(10, 'ปลาทูสด 2 ตัว, น้ำปลา 2 ช้อนโต๊ะ, กระเทียม 3 กลีบ, น้ำมันพืช 1 ช้อนโต๊ะ',
CONCAT( 
'1. ล้างปลาทูให้สะอาด บั้งปลา', CHAR(10),  
'2. ตำกระเทียมให้ละเอียด', CHAR(10),  
'3. ตั้งกระทะใส่น้ำมันพืช รอให้น้ำมันร้อน', CHAR(10),  
'4. ใส่ปลาทูลงทอดจนกรอบ', CHAR(10),  
'5. โรยน้ำปลาและกระเทียมลงไป ทอดต่อจนหอม')),

(11, 'ปลาทูสด 2 ตัว, ขมิ้น 1 ช้อนชา, กระเทียม 3 กลีบ, น้ำมันพืช 1 ช้อนโต๊ะ',
CONCAT( 
'1. ล้างปลาทูให้สะอาด บั้งปลา', CHAR(10),  
'2. ตำกระเทียมและขมิ้นให้ละเอียด', CHAR(10),  
'3. ตั้งกระทะใส่น้ำมันพืช รอให้น้ำมันร้อน', CHAR(10),  
'4. ใส่ปลาทูลงทอดจนกรอบ', CHAR(10),  
'5. โรยขมิ้นและกระเทียมลงไป ทอดจนหอม')),

(12, 'ปลาทูสด 2 ตัว, กระเทียม 5 กลีบ, พริกไทย 1 ช้อนชา, น้ำมันพืช 1 ช้อนโต๊ะ', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งปลา', CHAR(10),  
'2. ตำกระเทียมและพริกไทยให้ละเอียด', CHAR(10),  
'3. ตั้งกระทะใส่น้ำมันพืช รอให้น้ำมันร้อน', CHAR(10),
'4. ใส่ปลาทูลงทอดจนกรอบ', CHAR(10),  
'5. โรยกระเทียมและพริกไทยลงไป ทอดจนหอม')),

(13, 'ปลาทูสด 2 ตัว, น้ำมันพืช 1 ถ้วย, เกลือ 1 ช้อนชา', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งปลา', CHAR(10),  
'2. ตั้งกระทะใส่น้ำมันพืช รอให้น้ำมันร้อน', CHAR(10),  
'3. ใส่ปลาทูลงทอดจนกรอบ', CHAR(10),  
'4. โรยเกลือเล็กน้อย')),

(14, 'ปลาทูสด 2 ตัว, ใบมะกรูด 5 ใบ, ตะไคร้ 2 ต้น, พริกขี้หนู 5 เม็ด, น้ำมันพืช 1 ช้อนโต๊ะ',
CONCAT( 
'1. ล้างปลาทูให้สะอาด บั้งปลา', CHAR(10),  
'2. ตำพริกขี้หนูและสมุนไพรให้ละเอียด', CHAR(10),  
'3. ตั้งกระทะใส่น้ำมันพืช รอให้น้ำมันร้อน', CHAR(10),  
'4. ใส่ปลาทูลงทอดจนกรอบ', CHAR(10),  
'5. โรยสมุนไพรและพริกขี้หนูลงไป ทอดจนหอม')),

(15, 'ปลาทูสด 2 ตัว, พริกเผา 2 ช้อนโต๊ะ, กระเทียม 3 กลีบ, น้ำมันพืช 1 ช้อนโต๊ะ', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งปลา', CHAR(10),  
'2. ตั้งกระทะใส่น้ำมันพืช รอให้น้ำมันร้อน', CHAR(10),  
'3. ใส่ปลาทูลงทอดจนกรอบ', CHAR(10),  
'4. โรยพริกเผาและกระเทียมลงไป ทอดจนหอม')),

(16, 'ปลาทูสด 2 ตัว, พริกขี้หนู 5 เม็ด, น้ำมันพืช 1 ช้อนโต๊ะ', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งปลา', CHAR(10),  
'2. ตั้งกระทะใส่น้ำมันพืช รอให้น้ำมันร้อน ', CHAR(10), 
'3. ใส่ปลาทูลงทอดจนกรอบ', CHAR(10),  
'4. โรยพริกขี้หนูลงไป ทอดจนหอม')),

(17, 'ปลาทู 2 ตัว, ตะไคร้ 2 ต้น, ใบมะกรูด 4 ใบ, ขิง 1 ชิ้น, เกลือ 1 ช้อนชา', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งตัวปลา 2-3 รอบ', CHAR(10),   
'2. หั่นตะไคร้และขิงเป็นท่อน ส่วนใบมะกรูดฉีกเป็นชิ้น', CHAR(10),   
'3. ใส่ตะไคร้ ขิง และใบมะกรูดลงในหม้อนึ่ง', CHAR(10),   
'4. นำปลาทูวางบนตะแกรงนึ่ง และนึ่งในหม้อที่เตรียมไว้ประมาณ 10-15 นาที', CHAR(10),   
'5. เมื่อปลาทูนึ่งเสร็จแล้ว ให้เอาออกจากหม้อนึ่งและพร้อมทาน')),

(18, 'ปลาทู 2 ตัว, มะนาว 2 ลูก, พริกไทย 1 ช้อนชา, เกลือ 1 ช้อนชา', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งตัวปลา 2-3 รอบ', CHAR(10),   
'2. ผ่ามะนาวและคั้นน้ำมะนาวใส่ในชาม', CHAR(10),   
'3. เติมพริกไทยและเกลือลงในน้ำมะนาวแล้วคนให้เข้ากัน', CHAR(10),   
'4. นำปลาทูใส่ในหม้อแล้วนึ่งประมาณ 10-12 นาทีจนปลาสุก', CHAR(10),   
'5. เมื่อปลาทูสุกแล้ว ให้นำน้ำมะนาวราดลงไปบนตัวปลา')),

(19, 'ปลาทู 2 ตัว, ขมิ้นสด 1 ช้อนชา, เกลือ 1 ช้อนชา', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งตัวปลา 2-3 รอบ', CHAR(10),   
'2. ขูดขมิ้นสดและผสมกับเกลือ', CHAR(10),   
'3. ทาขมิ้นที่ผสมเกลือให้ทั่วตัวปลาทู', CHAR(10),   
'4. นำปลาทูไปนึ่งในหม้อที่เตรียมไว้ประมาณ 10-12 นาที', CHAR(10),   
'5. เมื่อปลาทูนึ่งเสร็จแล้ว สามารถทานได้ทันที')),

(20, 'ปลาทู 2 ตัว, ใบมะกรูด 5 ใบ, ขิงสด 1 ชิ้น, เกลือ 1 ช้อนชา', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งตัวปลา 2-3 รอบ', CHAR(10),   
'2. หั่นขิงเป็นแผ่นบาง และฉีกใบมะกรูด', CHAR(10),   
'3. ใส่ใบมะกรูดและขิงลงในหม้อนึ่ง', CHAR(10),   
'4. นำปลาทูใส่ในตะแกรงนึ่งและวางในหม้อที่มีใบมะกรูดและขิง', CHAR(10),   
'5. นึ่งประมาณ 10-15 นาทีจนปลาทูนึ่งเสร็จ')),

(21, 'ปลาทู 2 ตัว, น้ำปลา 2 ช้อนโต๊ะ, กระเทียม 2 กลีบ, พริกไทย 1 ช้อนชา', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งตัวปลา 2-3 รอบ', CHAR(10),   
'2. บุบกระเทียมให้ละเอียด', CHAR(10),   
'3. ผสมน้ำปลาและพริกไทยเข้าด้วยกันในชาม', CHAR(10),   
'4. นำปลาทูใส่ในหม้อแล้วราดน้ำปลาและกระเทียมที่เตรียมไว้', CHAR(10),   
'5. นึ่งปลาทูในหม้อประมาณ 10-12 นาทีจนปลาสุก')),

(22, 'ปลาทู 2 ตัว, พริกไทยดำ 1 ช้อนชา, เกลือ 1 ช้อนชา', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งตัวปลา 2-3 รอบ', CHAR(10),   
'2. ผสมพริกไทยและเกลือเข้าด้วยกัน', CHAR(10),   
'3. ทาพริกไทยและเกลือให้ทั่วตัวปลาทู', CHAR(10),   
'4. นำปลาทูไปนึ่งในหม้อที่เตรียมไว้ประมาณ 10-12 นาที', CHAR(10),   
'5. เมื่อปลาทูสุกแล้ว สามารถทานได้ทันที')),

(23, 'ปลาทู 2 ตัว, มะเขือเทศ 2 ลูก, เกลือ 1 ช้อนชา', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งตัวปลา 2-3 รอบ', CHAR(10),   
'2. หั่นมะเขือเทศเป็นชิ้นเล็กๆ', CHAR(10),   
'3. ใส่มะเขือเทศลงในหม้อแล้วปรุงรสด้วยเกลือ', CHAR(10),   
'4. นำปลาทูใส่ในตะแกรงนึ่งและวางในหม้อที่มีมะเขือเทศ', CHAR(10), 
'5. นึ่งประมาณ 10-12 นาทีจนปลาทูนึ่งเสร็จ')),

(24, 'ปลาทู 2 ตัว, เกลือ 2 ช้อนชา', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งตัวปลา 2-3 รอบ', CHAR(10),   
'2. โรยเกลือให้ทั่วตัวปลาทู', CHAR(10),   
'3. นำปลาทูใส่ในหม้อแล้วนึ่งประมาณ 10-12 นาทีจนปลาสุก', CHAR(10),   
'4. เมื่อปลาทูสุกแล้ว สามารถทานได้ทันที')),

(25, 'ปลาทู 2 ตัว, น้ำพริกเผา 2 ช้อนโต๊ะ, หอมแดง 3 หัว, มะนาว 1 ลูก, พริกขี้หนู 5 เม็ด, น้ำปลา 1 ช้อนโต๊ะ', 
CONCAT(
'1. ล้างปลาทูให้สะอาด บั้งตัวปลา 2-3 รอบ', CHAR(10),
'2. นำปลาทูไปย่างจนกรอบ', CHAR(10),   
'3. ทำน้ำยำโดยการบดพริกขี้หนูและหอมแดงเข้าด้วยกัน', CHAR(10),   
'4. เติมน้ำมะนาวและน้ำปลาลงไป แล้วคนให้เข้ากัน', CHAR(10),   
'5. นำปลาทูย่างที่เตรียมไว้มาแยกเนื้อ แล้วคลุกกับน้ำยำที่เตรียมไว้')),

(26,
'ปลาทู 2 ตัว, มะม่วงเปรี้ยวซอย 1 ถ้วย, พริกขี้หนู 5 เม็ด, หอมแดง 2 หัว, น้ำปลา 1 ช้อนโต๊ะ, น้ำตาลปี๊บ 1 ช้อนชา, น้ำมะนาว 2 ช้อนโต๊ะ',
CONCAT(
'1. นำปลาทูไปนึ่งหรือย่างแล้วแกะเนื้อเป็นชิ้น', CHAR(10),
'2. ซอยมะม่วง หอมแดง และสับพริกขี้หนูหยาบ', CHAR(10),
'3. ผสมน้ำปลา น้ำมะนาว น้ำตาล คนให้เข้ากัน', CHAR(10),
'4. ใส่ปลาทู มะม่วง หอมแดง พริก คลุกเคล้าให้เข้ากัน')),

(27,
'ปลาทู 2 ตัว, ใบชะพลูซอย 1 ถ้วย, หอมแดง 2 หัว, พริกขี้หนู 5 เม็ด, น้ำปลา 1 ช้อนโต๊ะ, น้ำมะนาว 1.5 ช้อนโต๊ะ',
CONCAT(
'1. นำปลาทูนึ่งสุก แกะเอาเฉพาะเนื้อ', CHAR(10),
'2. ซอยใบชะพลู หอมแดง และสับพริกขี้หนู', CHAR(10),
'3. ผสมน้ำปลา น้ำมะนาว คนให้เข้ากันในถ้วย', CHAR(10),
'4. ใส่ปลาทูและส่วนผสมอื่นๆ คลุกให้เข้ากัน')),

(28,
'ปลาทู 2 ตัว, ตะไคร้ซอย 2 ช้อนโต๊ะ, หอมแดง 2 หัว, ใบมะกรูดซอย 1 ช้อนโต๊ะ, พริกขี้หนู 5 เม็ด, น้ำปลา 1 ช้อนโต๊ะ, น้ำมะนาว 1.5 ช้อนโต๊ะ',
CONCAT(
'1. ย่างปลาทูให้สุก แล้วแกะเอาแต่เนื้อ', CHAR(10),
'2. ซอยตะไคร้ ใบมะกรูด หอมแดง และสับพริกขี้หนู', CHAR(10),
'3. ผสมน้ำมะนาว น้ำปลาในถ้วย', CHAR(10),
'4. ใส่ปลาทูและสมุนไพรที่เตรียมไว้ คลุกเคล้าให้เข้ากัน')),

(29,
'ปลาทู 2 ตัว, ขมิ้นสดขูด 1 ช้อนชา, พริกขี้หนู 5 เม็ด, หอมแดง 2 หัว, น้ำมะนาว 1.5 ช้อนโต๊ะ, น้ำปลา 1 ช้อนโต๊ะ',
CONCAT(
'1. นำปลาทูไปย่างหรือทอดจนสุก แล้วแกะเนื้อ', CHAR(10),
'2. ขูดขมิ้นสดให้ละเอียด ซอยหอมแดง สับพริก', CHAR(10),
'3. ผสมน้ำมะนาว น้ำปลา ขมิ้นลงในถ้วย', CHAR(10),
'4. ใส่ปลาทู หอมแดง พริก คลุกให้เข้ากัน')),

(30,
'ปลาทู 2 ตัว, มะเขือเทศหั่นเต๋า 1/2 ถ้วย, หอมแดง 2 หัว, พริกขี้หนู 4 เม็ด, น้ำปลา 1 ช้อนโต๊ะ, น้ำมะนาว 2 ช้อนโต๊ะ',
CONCAT(
'1. แกะเนื้อปลาทูที่สุกแล้ว เตรียมไว้', CHAR(10),
'2. หั่นมะเขือเทศ ซอยหอมแดง และสับพริก', CHAR(10),
'3. ผสมน้ำปลา น้ำมะนาวเข้าด้วยกัน', CHAR(10),
'4. คลุกทุกอย่างรวมกันเบาๆ')),

(31,
'ปลาทู 2 ตัว, พริกขี้หนู 6 เม็ด, หอมแดง 2 หัว, น้ำปลา 1 ช้อนโต๊ะ, น้ำมะนาว 2 ช้อนโต๊ะ, ผักชีซอยเล็กน้อย',
CONCAT(
'1. ย่างปลาทู แกะเนื้อพักไว้', CHAR(10),
'2. ซอยหอมแดง สับพริกขี้หนู และผักชี', CHAR(10),
'3. ผสมน้ำปลา น้ำมะนาวในถ้วย', CHAR(10),
'4. ใส่ส่วนผสมทั้งหมดลงคลุกเบาๆ')),

(32,
'ปลาทู 2 ตัว, พริกสดแดงเขียวรวมกัน 6 เม็ด, หอมแดง 2 หัว, น้ำปลา 1 ช้อนโต๊ะ, น้ำมะนาว 2 ช้อนโต๊ะ',
CONCAT(
'1. แกะเนื้อปลาทูสุกไว้', CHAR(10),
'2. หั่นพริกสดเฉียงๆ ซอยหอมแดง', CHAR(10),
'3. ผสมพริก น้ำปลา น้ำมะนาว', CHAR(10),
'4. คลุกเนื้อปลาทูลงกับเครื่อง'));